TOKEN = '6683519740:AAH9dQwzFKQyYcYbBTyYlTBEMHVPDlkQTxY'

rubricks_text = ['Полезные python библиотеки', 'Пример развития пет проекта для заработка (python)', 'База python']
example = '''🔊🐍 Привет, друзья! Сегодня мы поговорим о одном интересном модуле для Python - gTTS (Google Text-to-Speech)!

🎧 gTTS - это модуль, который позволяет преобразовывать текст в речь с помощью голосового движка Google. Он предоставляет удобный способ добавить функциональность синтеза речи в свои Python-приложения.

➡️ Вы можете использовать gTTS для создания:

📚 Аудиокниг или аудиоверсий текстовых материалов.
🎙 Помощников с голосовыми командами для своих проектов.
🌐 Озвучивания текстовых уведомлений и сообщений для своих пользователей.

🔮 Как использовать gTTS:

1️⃣ Установите gTTS с помощью pip: pip install gTTS.
2️⃣ Импортируйте модуль gTTS: from gtts import gTTS.
3️⃣ Создайте экземпляр gTTS и передайте в него текст, который нужно преобразовать в речь: tts = gTTS('Привет, мир!').
4️⃣ Сохраните аудиофайл с помощью метода save: tts.save('hello.mp3').

💡 И не забудьте добавить в свой проект нужные проверки наличия интернет-соединения и обработку возможных ошибок!

👍 Надеюсь, эта информация о модуле gTTS вам понравилась и пригодится в вашей питоновской разработке! Оставляйте комментарии и задавайте вопросы - я всегда готов помочь!

#Python #gTTS #синтезречи #аудиоприложения'''